app/controllers/books_controller.rb

SELECT  "books".* FROM "books" WHERE "books"."isbn" = ? LIMIT 1  [["isbn", "1234561"]]
---
  def searchbook
    @searchedbook = Book.find_by_isbn(params[:q])

INSERT INTO "books" ("isbn", "bookName", "authName", "bookEdition", "bookAction", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["isbn", "12312312"], ["bookName", "asdasd"], ["authName", ""], ["bookEdition", ""], ["bookAction", ""], ["created_at", "2015-03-08 21:22:47.026226"], ["updated_at", "2015-03-08 21:22:47.026226"]]
---
  def create
    @book = Book.new(book_params)

    respond_to do |format|
      if @book.save

UPDATE "books" SET "book_Name" = ?, "authName" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["book_Name", "New1"], ["authName", "New2"], ["updated_at", "2015-03-09 22:05:58.497652"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @book.update(book_params)