app/controllers/courses_controller.rb

  def show
    @booksforcourses = Book.where(course_number: @course.course_number)
---
SELECT "books".* FROM "books" WHERE "books"."course_number" = ?  [["course_number", ":course_number"]]

  def create
    @course = Course.new(course_params)

    respond_to do |format|
      if @course.save
---
INSERT INTO "courses" ("coursename", "course_number", "coursesection", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["coursename", "Web App Dev"], ["course_number", "Com381"], ["coursesection", "2"], ["created_at", "2015-03-10 04:23:12.416372"], ["updated_at", "2015-03-10 04:23:12.416372"]]